perf_test/results/recommend_profile_1000_RPS.txt
Requests      [total, rate, throughput]         59575, 991.70, 815.55
Duration      [total, attack, wait]             1m11s, 1m0s, 11.227s
Latencies     [min, mean, 50, 90, 95, 99, max]  511µs, 966.781ms, 252.075ms, 480.199ms, 650.011ms, 30.005s, 30.042s
Bytes In      [total, mean]                     116532600, 1956.07
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           97.61%
Status Codes  [code:count]                      0:1425  200:58150  
Error Set:
Get "http://localhost:8085/api/v0/recommend/home?limit=10": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49635->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49648->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49642->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49639->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49644->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49675->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49676->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49709->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49703->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49701->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49739->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49732->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49761->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49763->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49767->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49762->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49801->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49808->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49800->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49901->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49906->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49927->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49959->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49950->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:49946->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:50068->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:50073->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:50098->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:50099->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:50095->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:53819->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:53849->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:53951->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:53945->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54004->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54013->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54630->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54612->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54615->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54624->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54617->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54648->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54647->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54645->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54777->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54785->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55080->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55087->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55082->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55115->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55113->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55122->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55103->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55117->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55145->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55140->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55149->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55137->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55153->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55136->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55629->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55630->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55640->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55631->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55674->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55696->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55710->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57907->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57919->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57905->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57978->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:59190->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:51564->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:51581->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:51573->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:51579->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55001->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55018->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:54848->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55017->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55858->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55860->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55885->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55891->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55876->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55945->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55979->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:55995->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56087->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56089->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56248->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56256->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56251->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56254->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56258->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56280->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56358->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56352->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56356->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56441->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56438->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56446->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56495->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56497->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56475->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56554->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56681->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56796->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56828->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56810->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56888->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56881->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56876->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56874->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56886->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56916->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56878->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:56980->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57003->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57016->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57131->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57137->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57135->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57139->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57183->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57212->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57242->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57271->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57289->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57303->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57301->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57302->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57315->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57321->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57351->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57331->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57406->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57439->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57448->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57444->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57522->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57571->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57566->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57601->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57605->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64294->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64290->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64322->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64347->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64354->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64364->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64416->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64414->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64426->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64422->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64418->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64484->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64470->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64504->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64514->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64506->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64510->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64658->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:64656->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)